{
  "events": [
    {
      "date": "2025-09-19",
      "label": "Sep 19, 2025",
      "type": "political",
      "note": "The House passes a short-term Continuing Resolution (CR). The Senate does not advance the measure due to disagreements over spending priorities.",
      "key_names": ["House", "Senate"]
    },
    {
      "date": "2025-09-30",
      "label": "Sep 30, 2025",
      "type": "political",
      "note": "The Senate fails to advance both Democratic and Republican funding proposals, resulting in a lapse in federal funding at midnight.",
      "key_names": ["Senate"]
    },
    {
      "date": "2025-10-01",
      "label": "Oct 1, 2025",
      "type": "shutdown",
      "note": "Federal funding expires at 12:01 a.m. EDT, triggering a partial government shutdown. Approximately 900,000 employees are furloughed, and approximately 700,000 continue working without pay.",
      "cost": "$7–15B per week",
      "key_names": ["Federal Workforce"]
    },
    {
      "date": "2025-10-01",
      "label": "Oct 1, 2025",
      "type": "political",
      "note": "Senate leaders hold preliminary discussions on a shorter-term funding extension. No agreement is reached.",
      "key_names": ["Senate"]
    },
    {
      "date": "2025-10-01",
      "label": "Oct 1, 2025",
      "type": "economic",
      "note": "Financial markets respond to the shutdown. Stock futures fluctuate and gold prices reach elevated levels as investors assess potential economic impacts.",
      "key_names": ["Markets", "Investors"]
    },
    {
      "date": "2025-10-01",
      "label": "Oct 1, 2025",
      "type": "political",
      "note": "The administration announces a temporary pause of approximately $26 billion in previously approved federal funds, including allocations for transit and clean-energy projects, pending budget resolution.",
      "key_names": ["White House", "Federal Agencies", "States"]
    },
    {
      "date": "2025-10-02",
      "label": "Oct 2, 2025",
      "type": "shutdown",
      "note": "The Senate does not pass funding legislation. The partial government shutdown continues.",
      "key_names": ["Senate"]
    },
    {
      "date": "2025-10-02",
      "label": "Oct 2, 2025",
      "type": "political",
      "note": "Department of Education initiates an internal review following employee reports regarding modified automated out-of-office messages.",
      "key_names": ["Department of Education"]
    },
    {
      "date": "2025-10-03",
      "label": "Oct 3, 2025",
      "type": "shutdown",
      "note": "Speaker Mike Johnson extends the House recess as negotiations between congressional leaders continue.",
      "key_names": ["House", "Speaker Mike Johnson"]
    },
    {
      "date": "2025-10-05",
      "label": "Oct 5, 2025",
      "type": "shutdown",
      "note": "The federal government remains partially closed for a fifth day. Agencies continue limited operations while essential services remain active.",
      "key_names": ["Federal Government"]
    },
    {
      "date": "2025-10-06",
      "label": "Oct 6, 2025",
      "type": "shutdown",
      "note": "The Senate does not advance another stopgap funding bill requiring 60 votes. The President and White House issue statements calling for a bipartisan agreement to restore federal operations.",
      "key_names": ["Senate", "President", "White House"]
    }
  ]
}
